Repository: CodyBontecou/GitSync.md
Catalog: Sync.md/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, he, hi, hu, id, it, ja, ko, nb, nl, pl, pt_br, ru, sv, th, tr, uk, vi, zh_hans, zh_hant

source: GitSync.md now catches missing Author Name or Author Email before Commit & Push tries to create a commit.
ar: GitSync.md الآن اسم المؤلف المفقود أو البريد الإلكتروني للمؤلف قبل أن يحاول Commit & Push إنشاء التزام.
da: GitSync.md fanger nu manglende forfatternavn eller forfatter-e-mail, før Commit & Push forsøger at oprette en commit.
de: GitSync.md erkennt jetzt fehlende Autorennamen oder Autoren-E-Mails, bevor Commit & Push versucht, ein Commit zu erstellen.
es: GitSync.md ahora detecta que falta el nombre del autor o el correo electrónico del autor antes de que Commit & Push intente crear una confirmación.
fi: GitSync.md nyt saalistaa puuttuva Tekijä Nimi tai Tekijä Sähköposti ennen kuin Commit & Push yrittää luoda comiä Miten niin?
fr: GitSync.md attrape maintenant le nom de l&#39;auteur ou l&#39;email de l&#39;auteur manquant avant Commit & Push essaie de créer un commit.
he: GitSync.md מוסיפה תיעוד של חוסר שם או דוא"ל של המחבר לפני ש-Commit ו-Push ניסים ליצור Commit.
hi: GitSync.md अब 'Commit & Push' के दौरान, जब कोई कमिट बनाने का प्रयास होता है, तो 'Author Name' या 'Author Email' की अनुपस्थिति को पकड़ता है।
hu: GitSync.md jelenleg az „Commit & Push" eljárás előtt, amikor egy commit létrehozása kísérletet tesz, megakadályozza az „Author Name" vagy „Author Email" hiányát.
id: GitSync.md kini dapat mendeteksi ketiadaan Nama Penulis atau Alamat Email Penulis sebelum proses Commit & Push mencoba membuat commit.
it: GitSync.md ora rileva la mancanza del nome dell'autore o dell'indirizzo email prima che Commit & Push tenti di creare un commit.
ja: GitSync.md は、コミットおよびプッシュ時にコミットを作成しようとする前に、著者名または著者メールの欠落を検出します。
ko: GitSync.md 는 커밋 및 푸시 과정에서 커밋을 생성하려 할 때, 작성자 이름 또는 작성자 이메일이 누락된 경우를 자동으로 검출합니다.
nb: GitSync.md oppfanger nå manglende forfatternavn eller forfattere-postadresse før Commit & Push forsøker å lage en commit.
nl: GitSync.md detecteert nu het ontbreken van de auteurnaam of -e-mailadres voordat Commit & Push probeert een commit te maken.
pl: GitSync.md teraz wykrywa brak nazwy lub adresu e-mail autora przed tym, jak commit i push próbuje utworzyć commit.
pt_br: GitSync.md agora captura o caso de ausência do Nome do Autor ou do E-mail do Autor antes que o Commit & Push tente criar um commit.
ru: GitSync.md теперь обнаруживает отсутствие имени автора или электронной почты автора до того, как операция Commit & Push попытается создать коммит.
sv: GitSync.md upptäcker nu saknad författarens namn eller e-postadress innan Commit & Push försöker skapa en commit.
th: GitSync.md ปัจจุบันจะตรวจพบกรณีที่ขาดชื่อผู้เขียนหรืออีเมลของผู้เขียน ก่อนที่ Commit & Push จะพยายามสร้าง Commit
tr: GitSync.md , Commit ve Push komutu bir commit oluşturmaya çalışırken eksik Yazar Adı veya Yazar E-postası hata durumunu yakalar.
uk: GitSync.md зараз виявляє відсутність імені автора або електронної адреси автора до того, як команда «Commit & Push» намагатиметься створити коміт.
vi: GitSync.md hiện nay sẽ phát hiện trường hợp thiếu Tên tác giả hoặc Email tác giả trước khi Commit & Push cố gắng tạo commit.
zh_hans: GitSync.md 现在会在提交与推送尝试创建提交之前，捕获“作者姓名或作者邮箱缺失”的错误。
zh_hant: GitSync.md 現在會在提交與推送嚐試創建提交之前，捕穫“作者姓名或作者郵箱缺失”的錯誤。

source: GitSync.md now supports self-hosted Forgejo and Git servers that only expose SSH remotes.
ar: GitSync.md يدعم الآن Forgejo وخوادم Git ذاتية الاستضافة التي تعرض فقط أجهزة التحكم عن بعد SSH. لن يوفر
da: GitSync.md understøtter nu selv-hostede Forgejo og Git-servere, der kun afslører SSH fjernbetjeninger.
de: GitSync.md unterstützt jetzt selbstgehostete Forgejo- und Git-Server, die nur SSH-Remotes verfügbar machen.
es: GitSync.md ahora admite servidores Forgejo y Git autohospedados que solo exponen controles remotos SSH.
fi: GitSync.md tukee nyt itseään isännöitä Forgejo - ja Git-palvelimet, jotka vain paljastuvat SSH kaukosäätimet.
fr: GitSync.md prend désormais en charge l&#39;auto-hébergé Forgejo et Git serveurs qui exposent uniquement Télécommandes SSH .
he: GitSync.md currently unterstützt הפעלה עצמאית. Forgejo ו- השרתים Git שפועלים רק ב对外开放 SSH – מכשירי רימוט.
hi: GitSync.md अब स्व-होस्टिंग का समर्थन करता है। Forgejo तथा Git सर्वर जो केवल प्रदर्शित करते हैं। SSH रिमोट्स।
hu: GitSync.md jelenleg a saját környezetben futtatható módosításokat támogatja. Forgejo és Git szerverek, amelyek csupán bizonyos funkciókat nyújtanak el SSH távvezérlők. A
id: GitSync.md kini mendukung pengelolaan mandiri. Forgejo dan Server Git yang hanya menampilkan SSH remote control.
it: GitSync.md supporta ora l'hosting in proprio. Forgejo e Server Git che espongono solo SSH telecomandi.
ja: GitSync.md は、現在、セルフホスティングに対応しています。 Forgejo および Git ：公開する機能のみを提供するサーバー SSH リモート装置。
ko: GitSync.md 는 이제 자가 호스팅을 지원합니다. Forgejo 및 Git 서버는 오직 특정 기능만 제공합니다. SSH 리모트 장치.
nb: GitSync.md støtter nå selvhosting. Forgejo og Git Serverer som kun eksponerer SSH fjernkontroller.
nl: GitSync.md ondersteunt nu zelfgehoste oplossingen. Forgejo en Git servers die alleen openbaren SSH afstandsbedieningen.
pl: GitSync.md teraz obsługuje wersję samostawianą. Forgejo i Serwery Git , które oferują wyłącznie SSH 遥控ery.
pt_br: GitSync.md agora suporta hospedagem própria. Forgejo e Servidores Git que exibem apenas SSH controladores remotos.
ru: GitSync.md теперь поддерживает собственное развертывание. Forgejo и Серверы Git , предоставляющие только определённые функции SSH — дистанционные управляющие устройства.
sv: GitSync.md stöder nu självhanterad installation. Forgejo och Git -serverer som endast offentliggör SSH fjärrkontroll器.
th: GitSync.md ปัจจุบันรองรับการติดตั้งเอง (self-hosted) Forgejo และ Git เซิร์ฟเวอร์ที่แสดงเพียงสิ่งต่างๆ เท่านั้น SSH รีโมต
tr: GitSync.md artık kendi sunucuyla desteklenmektedir. Forgejo ve Git sunucuları yalnızca açıklayan sunucular SSH uzaktan kontrol cihazları.
uk: GitSync.md тепер підтримує самообслуговування. Forgejo та Git сервери, які відкривають лише SSH — дистанційні керування.
vi: GitSync.md hiện đã hỗ trợ khả năng tự triển khai. Forgejo và Git : các máy chủ chỉ cung cấp SSH – thiết bị điều khiển từ xa.
zh_hans: GitSync.md 现已支持自托管模式 Forgejo 及 Git 仅暴露相关服务的服务器 SSH 遥控器。
zh_hant: GitSync.md 現已支持自托管模式 Forgejo 及 Git 僅暴露相關服務的服務器 SSH 遙控器。

source: GitSync.md will not provide credentials. Choose this for public remotes or local file remotes.
ar: GitSync.md بيانات الاعتماد. اختر هذا لأجهزة التحكم عن بعد العامة أو أجهزة التحكم عن بعد للملفات المحلية.
da: GitSync.md giver ikke legitimationsoplysninger. Vælg dette for offentlige fjernbetjeninger eller lokale filfjernbetjeninger.
de: GitSync.md stellt keine Anmeldeinformationen bereit. Wählen Sie dies für öffentliche oder lokale Datei-Remotes.
es: GitSync.md no proporcionará credenciales. Elija esto para controles remotos públicos o controles remotos de archivos locales.
fi: GitSync.md ei anna valtakirjaa. Valitse tämä julkisille kauko- tai paikallisille tiedostojen etäyhteyksille.
fr: GitSync.md ne fournira pas les informations d&#39;identification. Choisissez ceci pour les télécommandes publiques ou les télécommandes de fichiers locaux.
he: GitSync.md לא יספק אימותים; בחרו ב선택 הזה עבור רימוטים ציבוריים או רימוטי קבצים מקומיים.
hi: GitSync.md किसी प्रमाणपत्र नहीं देगा। सार्वजनिक रिमोट्स या स्थानीय फ़ाइल रिमोट्स के लिए इसे चुनें।
hu: GitSync.md nem biztosít hitelesítő adatokat. Ez a lehetőséget válassza meg a közösségi távirányítók vagy helyi fájlműszeres távirányítók esetében.
id: GitSync.md tidak akan menyediakan kredensial. Pilih opsi ini untuk remote publik atau remote berbasis file lokal.
it: GitSync.md non fornirà le credenziali. Selezionare questa opzione per i remote pubblici o per i remote basati su file locali.
ja: GitSync.md は認証情報を提供しません。公開リモートまたはローカルファイルリモートの場合、このオプションを選択してください。
ko: GitSync.md 는 인증 정보를 제공하지 않습니다. 공용 리모트 또는 로컬 파일 리모트의 경우 이 옵션을 선택하십시오.
nb: GitSync.md vil ikke tilby identifikasjonsopplysninger. Velg dette for offentlige fjernkontroller eller lokale filfjernkontroller.
nl: GitSync.md biedt geen authenticatiegegevens aan. Kies dit voor openbare remote-apparaten of lokale bestandsservers.
pl: GitSync.md nie dostarczy danych uwierzytelniających. Wybierz tę opcję dla zdalnych urządzeń publicznych lub zdalnych plików lokalnych.
pt_br: GitSync.md não fornecerá credenciais. Escolha esta opção para remotas públicas ou remotas com arquivos locais.
ru: GitSync.md не предоставит учетные данные. Выберите эту опцию для публичных удалённых подключений или удалённых подключений через локальные файлы.
sv: GitSync.md kommer inte att tillhandahålla autentiseringsuppgifter. Välj detta för offentliga fjärrkontroller eller lokala filfjärrkontroller.
th: GitSync.md จะไม่ให้ข้อมูลบัญชีผู้ใช้ โปรดเลือกตัวเลือกนี้สำหรับโอนไฟล์จากอุปกรณ์สาธารณะหรือจากไฟล์ท้องถิ่น
tr: GitSync.md , kimlik bilgileri sağlamayacaktır. Kamu uygulamaları veya yerel dosya uygulamaları için bu seçeneği kullanın.
uk: GitSync.md не надасть авторизаційні дані. Оберіть цей варіант для публічних дистанційних з'єднань або локальних файлових дистанційних з'єднань.
vi: GitSync.md sẽ không cung cấp thông tin xác thực; hãy chọn tùy chọn này cho các thiết bị điều khiển từ xa công cộng hoặc các thiết bị điều khiển từ xa dựa trên tệp cục bộ.
zh_hans: GitSync.md 将不提供凭证。对于公共远程连接或本地文件远程连接，请选择此项。
zh_hant: GitSync.md 將不提供憑証。對於公共遠程連接或本地文件遠程連接，請選擇此項。
